#### Introduction To PANDAS

##### Installing PANDAS

In [ ]:
pip install pandas

##### Import PANDAS

In [ ]:
import pandas as pd
import numpy as np

##### Importing Dataset

In [ ]:
df = pd.read_csv("./nobel.csv")
df

##### Seeing First 5 rows or any number of rows.

In [ ]:
# df.head() # By default we get 5 rows
df.head(2)

##### Seeing Bottom 5 rows or any number of rows from Bottom

In [ ]:
# df.tail() # By default we get 5 rows from bottom
df.tail(2)

##### Checking/Analyzing Dataset

In [ ]:
#  Total Rows and Columns
df.shape

In [ ]:
# Just want to see number of rows only..
print('Number of Rows =', df.shape[0])

In [ ]:
# Just want to see number of columns only..
print('Number of Columns =', df.shape[1])

In [ ]:
# Want to see Column Names..
df.columns # return names of columns in a list

In [ ]:
# Iterating Columns Names using "For Loop"
for i in df.columns:
    print(i)

In [ ]:
# Checking Data types of each column
df.info()

In [ ]:
# Statistical Description
df.describe() # Analyze only columns with integer datatype

### FILTERING DATA

##### COLUMN WISE FILTERING

In [ ]:
df.head()

In [ ]:
# Slicing Columns
df["year"].head() # if we want to get only one column..

In [ ]:
# Another way to get one column
df.year

In [ ]:
# Want to slice multiple columns
df[['year','category' ]] # for slicing multiple columns we need to pass columns names in a list.

#### ROW WISE FILTERING

In [ ]:
# Fetching only rows where Sex == Male
df[df['sex']== 'Male']

In [ ]:
# Fetching only rows where Sex == Male
df[df['sex']== 'Male'].head()

In [ ]:
# syntax for multiple conditions
# df[(condition1) & (condition2) & (condition3)]
# df[(condition1) | (condition2) | (condition3)]

# To get Nobel prize details on basis of single condition
df[df['year']>=1950]

In [ ]:
# To get Nobel prize details on basis of multiple condition
df[(df['year']>=1920) & (df['year']<=1950)].head()

# We can also use between function, if we want to get data between a specific range.
df[df['year'].between(1920, 1950)]  # .between carries some parameters, need to explore documentation.

In [ ]:
#  to get nobel prize winners where category is either Physics or chemistry.
df[(df['category']=='Chemistry') | (df['category']== 'Physics')]

In [ ]:
temp = df[((df['year'] > 2000) & (df['category'] == 'Chemistry')) | (df['sex']== 'Male')]

In [ ]:
temp[temp['sex']=='Female']

#### .loc function

In [43]:
# .loc function is used to filter rows with the help of row indexes.
# 1. Only fetching rows with all columns.
df.loc[5:10] # 5-10 index ki rows milain gi.

,year,category,prize,motivation,prize_share,laureate_id,laureate_type,full_name,birth_date,birth_city,birth_country,sex,organization_name,organization_city,organization_country,death_date,death_city,death_country
5,1901,Physics,The Nobel Prize in Physics 1901,"""in recognition of the extraordinary services ...",1-Jan,1,Individual,Wilhelm Conrad RÃ¶ntgen,1845-03-27,Lennep (Remscheid),Prussia (Germany),Male,Munich University,Munich,Germany,2/10/1923,Munich,Germany
6,1902,Chemistry,The Nobel Prize in Chemistry 1902,"""in recognition of the extraordinary services ...",1-Jan,161,Individual,Hermann Emil Fischer,1852-10-09,Euskirchen,Prussia (Germany),Male,Berlin University,Berlin,Germany,7/15/1919,Berlin,Germany
7,1902,Literature,The Nobel Prize in Literature 1902,"""the greatest living master of the art of hist...",1-Jan,571,Individual,Christian Matthias Theodor Mommsen,1817-11-30,Garding,Schleswig (Germany),Male,NaN,NaN,NaN,11/1/1903,Charlottenburg,Germany
8,1902,Medicine,The Nobel Prize in Physiology or Medicine 1902,"""for his work on malaria, by which he has show...",1-Jan,294,Individual,Ronald Ross,1857-05-13,Almora,India,Male,University College,Liverpool,United Kingdom,9/16/1932,Putney Heath,United Kingdom
9,1902,Peace,The Nobel Peace Prize 1902,NaN,2-Jan,464,Individual,Ãlie Ducommun,1833-02-19,Geneva,Switzerland,Male,NaN,NaN,NaN,12/7/1906,Bern,Switzerland
10,1902,Peace,The Nobel Peace Prize 1902,NaN,2-Jan,465,Individual,Charles Albert Gobat,1843-05-21,Tramelan,Switzerland,Male,NaN,NaN,NaN,3/16/1914,Bern,Switzerland

In [45]:
# 2. Fetching rows either sinlge of multiple, and also getting specified columns.
# 2.A. Fetching only one column.
# df.loc[250:256, 'year']
# 2.B. Fetching multiple columns.
df.loc[250:256, ['year', 'sex', 'birth_city','category']]

     year   sex             birth_city    category
250  1950  Male                Hamburg   Chemistry
251  1950  Male  KÃ¶nigshÃ¼tte (ChorzÃ³w)   Chemistry
252  1950  Male               Trelleck  Literature
253  1950  Male      South Norwalk, CT    Medicine
254  1950  Male              Wloclawek    Medicine
255  1950  Male         Pittsburgh, PA    Medicine
256  1950  Male            Detroit, MI       Peace

#### .iloc

### VALUE COUNTS

In [46]:
#  GIVE count of values
df['sex'].value_counts()

sex
Male      905
Female     65
Name: count, dtype: int64

### Unique Values

In [47]:
df['category'].unique()

array(['Chemistry', 'Literature', 'Medicine', 'Peace', 'Physics',
       'Economics'], dtype=object)

In [50]:
df['year'].describe()

count    1000.000000
mean     1973.721000
std        34.523195
min      1901.000000
25%      1949.750000
50%      1979.000000
75%      2003.000000
max      2023.000000
Name: year, dtype: float64

#### AGGREGATE VALUES

#### NULL VALUES
##### isNull and isna are same functions

In [54]:
df.isnull() # return True and False on basis of null vlaues.

,year,category,prize,motivation,prize_share,laureate_id,laureate_type,full_name,birth_date,birth_city,birth_country,sex,organization_name,organization_city,organization_country,death_date,death_city,death_country
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False,False,False,True,True,True,False,False,False
4,False,False,False,True,False,False,False,False,False,False,False,False,True,True,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
996,False,False,False,False,False,False,False,False,False,True,False,False,False,False,False,True,True,True
997,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True,True,True,True
998,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True,True,True,True
999,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True

In [56]:
df.isnull().sum() # summing null values, column wise

year                      0
category                  0
prize                     0
motivation               88
prize_share               0
laureate_id               0
laureate_type             0
full_name                 0
birth_date               32
birth_city               36
birth_country            31
sex                      30
organization_name       264
organization_city       265
organization_country    265
death_date              404
death_city              421
death_country           415
dtype: int64

#### sort values

In [59]:
df.isna().sum().sort_values(ascending=False) # By Default it shows in Ascending form, means Ascending is True

death_city              421
death_country           415
death_date              404
organization_city       265
organization_country    265
organization_name       264
motivation               88
birth_city               36
birth_date               32
birth_country            31
sex                      30
year                      0
category                  0
laureate_type             0
prize                     0
full_name                 0
prize_share               0
laureate_id               0
dtype: int64